# ==========================================
# โจทย์ข้อที่ 5: คำนวณค่าไฟฟ้าตามหน่วยที่ใช้
# Input: จำนวนหน่วยไฟฟ้าที่ใช้ (จำนวนเต็ม)
# Output: ค่าไฟฟ้ารวม (จำนวนเต็ม)
# เงื่อนไข: ไม่เกิน 50 หน่วย (หน่วยละ 3 บาท) | ไม่เกิน 100 หน่วย (หน่วยละ 4 บาท) | เกิน 100 หน่วย (หน่วยละ 5 บาท)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
unit = int(input("1จำนวนหน่วยค่าไฟที่ใช้")("จำนวนเต็ม"))
unit=("ค่าไฟรวม")("จำนวนเต็ม")
float;("ไม่เกิน 50 หน่วย (หน่วยละ 3 บาท )")("ไม่เกิน100หน่วย('หน่วยละ4บาท)")("เกิน 100หน่วย")('หน่วยละ 5 บาท')
